mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_CFG/FMKCFG_ConfigSpecific/FMKCPU_ConfigSpecific.h
/*********************************************************************
 * @file        FMKCPU_ConfigSpecific.h
 * @brief       Template_BriefDescription.
 * @details     TemplateDetailsDescription.\n
 *
 * @author      xxxxxx
 * @date        jj/mm/yyyy
 * @version     1.0
 */
  
#ifndef FMKPU_CONFIGSPECIFIC_H_INCLUDED
#define FMKPU_CONFIGSPECIFIC_H_INCLUDED





    // ********************************************************************
    // *                      Includes
    // ********************************************************************
    #include "stm32f0xx_hal_tim.h"
    // ********************************************************************
    // *                      Defines
    // ********************************************************************

    // ********************************************************************
    // *                      Types
    // ********************************************************************
    //-----------------------------ENUM TYPES-----------------------------//
    /* CAUTION : Automatic generated code section for Enum: Start */

    /* CAUTION : Automatic generated code section for Enum: End */

    //-----------------------------TYPEDEF TYPES---------------------------//
    //-----------------------------STRUCT TYPES---------------------------//
    /* CAUTION : Automatic generated code section for Structure: Start */

    /* CAUTION : Automatic generated code section for Structure: End */
    // ********************************************************************
    // *                      Prototypes
    // ********************************************************************
        
    // ********************************************************************
    // *                      Variables
    // ********************************************************************
    


    //********************************************************************************
    //                      Public functions - Prototyupes
    //********************************************************************************
    // Flag automatic generate code 
    void FMKCPU_Enable_SYSCFG_Clock(void);
    void FMKCPU_Enable_ADC1_Clock(void)  ;
    void FMKCPU_Enable_TIM1_Clock(void)  ;
    void FMKCPU_Enable_TIM3_Clock(void)  ;
    void FMKCPU_Enable_TIM14_Clock(void) ;
    void FMKCPU_Enable_TIM15_Clock(void) ;
    void FMKCPU_Enable_TIM16_Clock(void) ;
    void FMKCPU_Enable_TIM17_Clock(void) ;
    void FMKCPU_Enable_SPI1_Clock(void)  ;
    void FMKCPU_Enable_SPI2_Clock(void)  ;
    void FMKCPU_Enable_USART1_Clock(void);
    void FMKCPU_Enable_USART2_Clock(void);
    void FMKCPU_Enable_I2C1_Clock(void)  ;
    void FMKCPU_Enable_GPIOA_Clock(void) ;
    void FMKCPU_Enable_GPIOB_Clock(void) ;
    void FMKCPU_Enable_GPIOC_Clock(void) ;
    void FMKCPU_Enable_GPIOF_Clock(void) ;
    void FMKCPU_Enable_CRC_Clock(void)   ;
    void FMKCPU_Enable_DMA1_Clock(void)  ;
    void FMKCPU_Enable_SRAM_Clock(void)  ;
    void FMKCPU_Enable_FLITF_Clock(void) ;
    void FMKCPU_Enable_WWDG_Clock(void)  ;
    void FMKCPU_Enable_PWR_Clock(void)   ;

    // Fonctions pour désactiver les
    void FMKCPU_Disable_SYSCFG_Clock(void) ;
    void FMKCPU_Disable_ADC1_Clock(void)   ;
    void FMKCPU_Disable_TIM1_Clock(void)   ;
    void FMKCPU_Disable_TIM3_Clock(void)   ;
    void FMKCPU_Disable_TIM14_Clock(void)  ;
    void FMKCPU_Disable_TIM15_Clock(void)  ;
    void FMKCPU_Disable_TIM16_Clock(void)  ;
    void FMKCPU_Disable_TIM17_Clock(void)  ;
    void FMKCPU_Disable_SPI1_Clock(void)   ;
    void FMKCPU_Disable_SPI2_Clock(void)   ;
    void FMKCPU_Disable_USART1_Clock(void) ;
    void FMKCPU_Disable_USART2_Clock(void) ;
    void FMKCPU_Disable_I2C1_Clock(void)   ;
    void FMKCPU_Disable_GPIOA_Clock(void)  ;
    void FMKCPU_Disable_GPIOB_Clock(void)  ;
    void FMKCPU_Disable_GPIOC_Clock(void)  ;
    void FMKCPU_Disable_GPIOF_Clock(void)  ;
    void FMKCPU_Disable_CRC_Clock(void)    ;
    void FMKCPU_Disable_DMA1_Clock(void)   ;
    void FMKCPU_Disable_SRAM_Clock(void)   ;
    void FMKCPU_Disable_FLITF_Clock(void)  ;
    void FMKCPU_Disable_WWDG_Clock(void)   ;
    void FMKCPU_Disable_PWR_Clock(void)    ;

#endif // FMKPU_CONFIGSPECIFIC_H_INCLUDED           
//************************************************************************************
// End of File
//************************************************************************************

/**
 *
 *	@brief
 *	@details
 *
 *
 *	@params[in] 
 *	@params[out]
 *	 
 *
 *
 */
